const imageMap = new Map();

imageMap.set("image-1", {
    src: "../Images/chapter1/image1.wmf",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 1: Σχέδιο Ναυπηγικών Γραμμών παραδοσιακού σκάφους τύπου «πέραμα»."
});

imageMap.set("image-2", {
    src: "../Images/chapter1/image2.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 2: Τρισδιάστατη απεικόνιση ενός υδραίικου βαρκαλά, τοποθετημένου σε σύστημα συντεταγμένων x, y, z."
});

imageMap.set("image-3", {
    src: "../Images/chapter1/image3.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 3: Αναπαραστάσεις των τομών της γάστρας από επίπεδα που είναι παράλληλα στα τρία επίπεδα αναφοράς. Α/ τομή της γάστρας με επίπεδο παράλληλο στο διάμηκες επίπεδο αναφοράς και απεικόνιση των ορθών προβολών του στα σχέδια ναυπηγικών γραμμών, Β/ τομή της γάστρας με επίπεδο παράλληλο στο οριζόντιο επίπεδο αναφοράς και απεικόνιση των ορθών προβολών του στα σχέδια ναυπηγικών γραμμών, Γ/ τομές της γάστρας με επίπεδα παράλληλα στο εγκάρσιο κατακόρυφο επίπεδο αναφοράς και απεικόνιση των ορθών προβολών τους στα σχέδια ναυπηγικών γραμμών."
});

imageMap.set("image-4", {
    src: "../Images/chapter1/image4.png",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 4: Σχέδιο Ναυπηγικών Γραμμών παραδοσιακού σκάφους τύπου ‘πέραμα στο οποίο συμπεριλαμβάνεται και σχέδιο διαγώνιων γραμμών."
});

imageMap.set("image-5", {
    src: "../Images/chapter1/image5.wmf",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 5: Ναυπηγικό σχέδιο μελέτης υδραίικου βαρκαλά. Το σχέδιο περιλαμβάνει ισάλους (W), διαμήκεις γραμμές (BB) και θεωρητικούς νομείς (F)."
});

imageMap.set("image-6", {
    src: "../Images/chapter1/image6.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 1: Παραδοσιακή σάλα στο ναυπηγείο των αδελφών Μαυρίκων στη Σύρο, 1983. Μουσείο Ναυπηγικών και Ναυτικών Τεχνών του Αιγαίου, Φωτ. Μ. Τερζοπούλου."
});

imageMap.set("image-7", {
    src: "../Images/chapter1/image7.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 2: Σύγχρονη σάλα του τσερνικοπεράματος «Μεταμόρφωση» στο ναυπηγείο Patmos Marine. Κατασκευή σάλας Κ. Χωριανόπουλος. Μουσείο Ναυπηγικών και Ναυτικών Τεχνών του Αιγαίου, Φωτ.: Κ. Χωριανόπουλος."
});

imageMap.set("image-8", {
    src: "../Images/chapter1/image8.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 3: Σύγχρονη σάλα και χνάρια της σάλας του τσερνικοπεράματος «Μεταμόρφωση» στο ναυπηγείο Patmos Marine. Κατασκευή σάλας Κ. Χωριανόπουλος. Μουσείο Ναυπηγικών και Ναυτικών Τεχνών του Αιγαίου, Φωτ.: Κ. Χωριανόπουλος."
});

imageMap.set("image-9", {
    src: "../Images/chapter1/image9.wmf",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 6: Αντίγραφο του ναυπηγικού δαπέδου, της σάλας, των αδελφών Μαυρίκων στη Σύρο. Τα σχέδια ισάλων και διαμήκων του κάθε καϊκιού έχουν κοπεί στη μέση σε δύο τμήματα και έχουν σχεδιαστεί το ένα πάνω στο άλλο για να χωρέσουν πάνω στο δάπεδο της. Το κατασκευασμένο αντίγραφο βρίσκεται στην εσωτερική έκθεση του Μουσείου Ναυπηγικών και Ναυτικών Τεχνών του Αιγαίου. Έχουν σχεδιαστεί έξι καΐκια και για να ξεχωρίζουν έχουν διαφορετικά χρώματα:"
});

imageMap.set("image-10", {
    src: "../Images/chapter1/image10.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 4: Σαλότο ενός περάματος από το ναυπηγείο του Εμμανουήλ Τσαλαπατάνη στον Μαραθόκαμπο της Σάμου, 1999. Φωτ. Κ. Δαμιανίδης, ΜΝΝΤΑ."
});

imageMap.set("image-11", {
    src: "../Images/chapter1/image11.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 5: μισομόδελο με φέτες από φυσικό ξύλο, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-13", {
    src: "../Images/chapter1/image13.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 9: Μισομόδελο ενός τρεχαντηριού από το Ναυπηγείο Γ. Νικολάκη στην Αστυπάλαια. ΜΝΝΤΑ."
});

imageMap.set("image-14", {
    src: "../Images/chapter1/image14.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 7: Μισομόδελο ενός λίμπερτι από το ναυπηγείο του Εμμανουήλ Ψαρρού στο Πέραμα. ΜΝΝΤΑ."
});

imageMap.set("image-15", {
    src: "../Images/chapter1/image15.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 8: Μισομόδελο ενός βαρκαλά από το ναυπηγείο του Νομικού Καστρινού στη Κάλυμνο. ΜΝΝΤΑ."
});

imageMap.set("image-16", {
    src: "../Images/chapter1/image16.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 10: Μισομόδελο ενός καϊκιού, πιθανώς περάματος, από το ναυπηγείο του Φρατζή Μελαχρινού στο Ηραίο της Σάμου. ΜΝΝΤΑ."
});

imageMap.set("image-17", {
    src: "../Images/chapter1/image17.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 11: Μισομόδελο ενός περάματος με νομείς, από το ναυπηγείο των αδελφών Γιαμουγιάννη στο Πλωμάρι, 1995. Φωτ. Κ. Δαμιανίδης, ΜΝΝΤΑ."
});

imageMap.set("image-18", {
    src: "../Images/chapter1/image18.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 7: Πλήρες ναυπηγικό σχέδιο υδραίικου βαρκαλά μήκους 4,60μ. με κατασκευαστικούς νομείς που πρόκειται να σχεδιαστεί σε 1:1 στη σάλα."
});

imageMap.set("image-19", {
    src: "../Images/chapter1/image19.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 12: Ο πίνακας διαστασιολόγησης μιας υδραίικης βάρκας μήκους 4,60. Με κόκκινο κύκλο σημειώνονται οι επιλεγμένοι νομείς που θα σχεδιαστούν πάνω στη σάλα."
});

imageMap.set("image-20", {
    src: "../Images/chapter1/image20.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 8: Οι ναυπηγικές γραμμές μίας βάρκας με διαγωγή (μαύρο) και οι βασικές γραμμές της ίδιας βάρκας χωρίς διαγωγή (κόκκινο)."
});

imageMap.set("image-21", {
    src: "../Images/chapter1/image21.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 9: Στο σχήμα φαίνονται οι άξονες αναφοράς και οι άξονες τομών των επιλεγμένων νομέων για να σχεδιαστούν στη σάλα (Stern frames 8S, 6S, 4S, 2S, Middle frames M, και Bow frames 2B, 4B, 6B, 8B, 10B), των παρισάλων (Water lines WL1, WL2, WL3, WL4 και WL5) και των διαμήκων (bow and buttock lines Β1 και Β2). Στο συγκεκριμένο παράδειγμα σχεδιασμού ο άξονας συμμετρίας και αναφοράς έχει τοποθετηθεί έτσι ώστε να περνά από την θέση του μεσαίου νομέα στα σχέδια πλάγιας όψης και κάτοψης."
});

imageMap.set("image-22", {
    src: "../Images/chapter1/image22.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 13: Τοποθέτηση των τεριζιών για την σχεδίαση της κουπαστής στην πλάγια όψη, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-24", {
    src: "../Images/chapter1/image24.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 15: Τοποθέτηση του τεριζιού για την σχεδίαση του ασσού της καρίνας και του πρυμνιού ποδοστάματος, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-26", {
    src: "../Images/chapter1/image26.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 17: Σχεδιασμός του μεσαίου νομέα, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-28", {
    src: "../Images/chapter1/image28.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 10: Οι πρώτες βασικές ναυπηγικές γραμμές της σάλας (κουπαστή, καρίνα, ποδοστάματα, ασσοί, μεσαίος νομέας και προβολές του καθρέφτη)."
});

imageMap.set("image-29", {
    src: "../Images/chapter1/image29.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 19: Τοποθέτηση των τιριζιών για την σχεδίαση των βασικών νομέων από την μέση προς την πλώρη, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-30", {
    src: "../Images/chapter1/image30.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 20: Τοποθέτηση των τεριζιών για την σχεδίαση των παρισάλων και των διαμήκων από την μέση προς την πλώρη, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-31", {
    src: "../Images/chapter1/image31.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 21: Χάραξη των καμπύλων γραμμών παρισάλων με μαρκαδόρο, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-32", {
    src: "../Images/chapter1/image32.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 22: Ολοκλήρωση της τοποθέτησης των τεριζιών του πλωριού τμήματος, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-33", {
    src: "../Images/chapter1/image33.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 23: Παράδειγμα εξομάλυνσης της διαμήκους ΒΒ1 στο σημείο που τέμνει το νομέα 4Β, μετά από προσεκτική παρατήρηση της γραμμής που έχει σχηματιστεί με το τερίζι, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-35", {
    src: "../Images/chapter1/image35.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 11: Οι ναυπηγικές γραμμές του υδραίικου βαρκαλά που επιλέχθηκε να σχεδιαστούν στη σάλα. Σχεδιάζονται: οι νομείς 8S, 6S, 4S, 2S, Μ, 2Β, 4Β, 6Β, 8Β και 10B, οι ίσαλοι WL1, WL2, WL3, WL4 και WL5, οι διαμήκεις BB1 και BB2 και η διαγώνια D1."
});

imageMap.set("image-36", {
    src: "../Images/chapter1/image36.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 25: Τοποθέτηση τεριζιών για τη σχεδίαση των νομέων στη πρύμνη, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-38", {
    src: "../Images/chapter1/image38.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 27: Ολοκλήρωση της τοποθέτησης των τεριζιών του πλωριού τμήματος, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-39", {
    src: "../Images/chapter1/image39.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 12: Σχεδιασμός, με κατάκλιση, του πραγματικού σχήματος του καθρέφτη, πάνω στο σχέδιο της πλάγιας όψης."
});

imageMap.set("image-40", {
    src: "../Images/chapter1/image40.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 28: Η σχεδίαση της επάνω ακμής του καθρέφτη (κορώνη) στη σάλα, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-42", {
    src: "../Images/chapter1/image42.png",
    alt: ".",
    class: "text-image",
    caption: "3ος τρόπος: Με κατασκευή χναριού της αρχικής καμπύλης του νομέα, σημάδεμα με μολύβι του πάχους του πετσώματος πάνω στο χνάρι και κόψιμο στην κορδέλα του τμήματος που αντιστοιχεί στο πέτσωμα για να φτιαχτεί η καμπύλη του νομέα που θα κατασκευαστεί."
});

imageMap.set("image-44", {
    src: "../Images/chapter1/image44.jpeg",
    alt: ".",
    class: "text-image",
    caption: "Σχ. 13: Σχέδιο εγκάρσιας τομής της διαμόρφωσης του ασσού στην καρίνα ."
});

imageMap.set("image-45", {
    src: "../Images/chapter1/image45.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 30: Οι μετρήσεις και το σημάδεμα του ασσού από το σχέδιο των νομέων, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-47", {
    src: "../Images/chapter1/image47.png",
    alt: ".",
    class: "text-image",
    caption: "2ος τρόπος: Με την τοποθέτηση τεριζιού πάνω στην εξωτερική καμπύλη του νομέα, το κόψιμο του χναριού περίπου στο σχήμα του νομέα και τη χρησιμοποίηση της ροδέλας με την τρύπα στο κέντρο για να προσδιοριστεί με τον ίδιο τρόπο όπως αναφέρθηκε πιο πριν η εσωτερική πλευρά του πετσώματος πάνω στο χνάρι. Στην περίπτωση αυτή το χνάρι πρέπει να είναι πιο λεπτό από το πάχος του τεριζού."
});

imageMap.set("image-48", {
    src: "../Images/chapter1/image49.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 32: Σημάδεμα των αξόνων επάνω στο χνάρι του νομέα, για την αποτύπωση των κλίσεων (στέλες) , Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-50", {
    src: "../Images/chapter1/image51.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 34: Αποτύπωση στέλας νομέα πάνω σε παρίσαλο, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-52", {
    src: "../Images/chapter1/image53.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 36: Μέτρηση της προβολή της κλίσης/στέλας με τη βοήθεια ξύλου στο πάχος νομέα, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-54", {
    src: "../Images/chapter1/image55.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 38: Σημάδεμα της στέλας του νομέα πάνω στο χνάρι του, Φωτ.: Γ. Κυριαζής"
});

imageMap.set("image-56", {
    src: "../Images/chapter1/image57.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 40: Σημάδεμα της γραμμής της στέλας επάνω στο ξύλο του νομέα, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-58", {
    src: "../Images/chapter1/image59.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 42: Τοποθέτηση του χναριού του νομέα με τη βοήθεια του χναριού για τα φάρδιτα, Φωτ.: Γ. Κυριαζής."
});

imageMap.set("image-59", {
    src: "../Images/chapter1/image60.png",
    alt: ".",
    class: "text-image",
    caption: "Εικ. 43: Παράδειγμα χναριού του πλάτους - “χνάρι για τα φάρδιτα”, Φωτ.: Γ. Κυριαζής."
});

